maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_uart_hal_common_configurations.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "fsl_uart_hal.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_init
 * Description   : Initialize the UART controller.
 * This function will initialize the module to user defined settings and default settings.
 * Here is an example demonstrating how to define the uart_config_t structure and call
 * the uart_hal_init function:
 *   uart_config_t uartConfig;
 *   uartConfig.uartSourceClockInHz = uartSourceClock;
 *   uartConfig.baudRate = baudRate;
 *   uartConfig.bitCountPerChar = kUart8BitsPerChar;
 *   uartConfig.parityMode = kUartParityDisabled;
 *   uartConfig.stopBitCount = kUartOneStopBit;
 *   uartConfig.txDataInvert = 0;    uartConfig.rxDataInvert = 0;
 *   uart_hal_init(uartInstance, &uartConfig);
 *
 *END**************************************************************************/
uart_status_t uart_hal_init(uint32_t uartInstance, const uart_config_t *config)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* first, disable the UART transmitter and receiver*/
    uart_hal_disable_transmitter(uartInstance);
    uart_hal_disable_receiver(uartInstance);

    /*********************************************************/
    /* calculate baud rate settings                          */
    /*********************************************************/
    if (uart_hal_set_baud_rate(uartInstance, config->uartSourceClockInHz, config->baudRate)
        != kStatus_UART_Success)
    {
        return kStatus_UART_BaudRateCalculationError;
    }

    /*********************************************************/
    /* configure number of bits in a char                    */
    /*********************************************************/
    if (uart_hal_configure_bit_count_per_char(uartInstance, config->bitCountPerChar)
        != kStatus_UART_Success)
    {
        return kStatus_UART_BitCountNotSupported;
    }

    /*********************************************************/
    /* configure the parity enable/type                      */
    /*********************************************************/
    uart_hal_configure_parity_mode(uartInstance, config->parityMode);

    /*********************************************************/
    /* configure the number of stop bits                     */
    /*********************************************************/
    if (uart_hal_configure_stop_bit_count(uartInstance, config->stopBitCount) !=
        kStatus_UART_Success)
    {
        return kStatus_UART_StopBitCountNotSupported;
    }

    /*********************************************************/
    /* configure tx and rx inversions                        */
    /*********************************************************/
    uart_hal_configure_tx_rx_inversion(uartInstance, config->rxDataInvert, config->txDataInvert);

    /* finally, enable the UART transmitter and receiver*/
    uart_hal_enable_transmitter(uartInstance);
    uart_hal_enable_receiver(uartInstance);

    return kStatus_UART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_set_baud_rate
 * Description   : Configure the UART baud rate.
 * This function programs the UART baud rate to the desired value passed in by the user. The user
 * must also pass in the module source clock so that the function can calculate the baud
 * rate divisors to their appropriate values.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this is be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
uart_status_t uart_hal_set_baud_rate(uint32_t uartInstance, uint32_t sourceClockInHz,
                                uint32_t desiredBaudRate)
{
    uint16_t sbr;

    assert(uartInstance < UART_INSTANCE_COUNT);

/* SoCs with low power uart support differ in how they calculate the baud rate
 * for various instances of the uart from SoCs without low power uart support
 */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    uint16_t sbrTemp;
    uint32_t osr;
    uint8_t i;
    uint32_t tempDiff;
    uint32_t calculatedBaud, baudDiff;

    /* calculate baud rate settings*/
    if (uartInstance == 0)
    {
        /* This uart instantiation uses a slightly different baud rate calculation
         * The idea is to use the best OSR (over-sampling rate) possible
         * Note, osr is typically hard-set to 16 in other uart instantiations
         * First calculate the baud rate using the minimum OSR possible (4)
         */
        osr = 4;
        sbr = (sourceClockInHz/(desiredBaudRate * osr));
        calculatedBaud = (sourceClockInHz / (osr * sbr));

