maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_uart_hal_common_configurations.c
        if (calculatedBaud > desiredBaudRate)
        {
            baudDiff = calculatedBaud - desiredBaudRate;
        }
        else
        {
            baudDiff = desiredBaudRate - calculatedBaud;
        }

        /* loop to find the best osr value possible, one that generates minimum baudDiff
         * iterate through the rest of the supported values of osr
         */
        for (i = 5; i <= 32; i++)
        {
            /* calculate the temporary sbr value   */
            sbrTemp = (sourceClockInHz/(desiredBaudRate * i));
            /* calculate the baud rate based on the temporary osr and sbr values*/
            calculatedBaud = (sourceClockInHz / (i * sbrTemp));

            if (calculatedBaud > desiredBaudRate)
            {
                tempDiff = calculatedBaud - desiredBaudRate;
            }
            else
            {
                tempDiff = desiredBaudRate - calculatedBaud;
            }

            if (tempDiff <= baudDiff)
            {
                baudDiff = tempDiff;
                osr = i;  /* update and store the best osr value calculated*/
                sbr = sbrTemp;  /* update store the best sbr value calculated*/
            }
        }

        /* next, check to see if actual baud rate is within 3% of desired baud rate
         * based on the best calculate osr value
         */
        if (baudDiff < ((desiredBaudRate / 100) * 3))
        {
            /* Acceptable baud rate */
            /* Check if osr is between 4x and 7x oversampling*/
            /* If so, then "BOTHEDGE" sampling must be turned on*/
            if ((osr > 3) && (osr < 8))
            {
                HW_UART0_C5_SET(BM_UART0_C5_BOTHEDGE);
            }

            /* program the osr value (bit value is one less than actual value)*/
            BW_UART0_C4_OSR(osr-1);

            /* program the sbr (divider) value obtained above*/
            BW_UART0_BDH_SBR((uint8_t)(sbr >> 8));
            BW_UART0_BDL_SBR((uint8_t)sbr);
        }
        else
        {
            /* Unacceptable baud rate difference of more than 3%*/
            return kStatus_UART_BaudRatePercentDiffExceeded;
        }
    }
    else
    {
        /* calculate the baud rate modulo divisor, sbr*/
        sbr = sourceClockInHz / (desiredBaudRate * 16);

        /* check to see if sbr is out of range of register bits */
        if ( (sbr > 0x1FFF) || (sbr < 1) )
        {
            /* unsupported baud rate for given source clock input*/
            return kStatus_UART_BaudRateCalculationError;
        }

        /* next, check to see if actual baud rate is within 3% of desired baud rate
         * calculate baud rate based on previosuly calculated sbr
         */
        calculatedBaud = (sourceClockInHz  / (16 * sbr));

        if (calculatedBaud > desiredBaudRate)
        {
            baudDiff = calculatedBaud - desiredBaudRate;
        }
        else
        {
            baudDiff = desiredBaudRate - calculatedBaud;
        }

        /* check for baud rate to be within 3%*/
        if (baudDiff > ((desiredBaudRate / 100) * 3))
        {
            /* Unacceptable baud rate difference of more than 3%*/
            return kStatus_UART_BaudRatePercentDiffExceeded;
        }

        /* Else, baud rate is ok and write to the SBR bits in the BDH and BDL registers*/
        BW_UART_BDH_SBR(uartInstance, (uint8_t)(sbr >> 8));
        BW_UART_BDL_SBR(uartInstance, (uint8_t)sbr);
    }
#else
    /* BaudRate = (SourceClkInHz)/[16 * (SBR +  BRFA)]
     * First, calculate SBR (integer part) then calculate the BRFA (fine adjust fractional field)
     */
    uint16_t brfa;

    /* calculate the baud rate modulo divisor, sbr*/
    sbr = sourceClockInHz / (desiredBaudRate * 16);

    /* check to see if sbr is out of range of register bits */
    if ( (sbr > 0x1FFF) || (sbr < 1) )
    {
        /* unsupported baud rate for given source clock input*/
        return kStatus_UART_BaudRateCalculationError;
    }

    /* write the sbr value to the BDH and BDL registers*/
    BW_UART_BDH_SBR(uartInstance, (uint8_t)(sbr >> 8));
    BW_UART_BDL_SBR(uartInstance, (uint8_t)sbr);

    /* determine if a fractional divider is needed to fine tune closer to the desired baud
     * each value of brfa is in 1/32 increments, hence the multiply-by-32
     */
    brfa = (32*sourceClockInHz/(desiredBaudRate*16)) - 32*sbr;

    /* write the brfa value to the register*/
    BW_UART_C4_BRFA(uartInstance, brfa);
#endif

    return kStatus_UART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_set_baud_rate_divisor
 * Description   : Set the UART baud rate modulo divisor value.
 * This function allows the user to program the baud rate divisor directly in situations
 * where the divisor value is known. In this case, the user may not want to call the
 * uart_hal_set_baud_rate() function as the divisor is already known to them.
 *
 *END**************************************************************************/
uart_status_t uart_hal_set_baud_rate_divisor(uint32_t uartInstance, uint32_t baudRateDivisor)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* check to see if baudRateDivisor is out of range of register bits */
    if ( (baudRateDivisor > 0x1FFF) || (baudRateDivisor < 1) )
    {
        /* unsupported bit setting*/
        return kStatus_UART_InvalidBitSetting;
    }

#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* program the sbr (baudRateDivisor) value to the BDH and BDL registers*/
        BW_UART0_BDH_SBR((uint8_t)(baudRateDivisor >> 8));
        BW_UART0_BDL_SBR((uint8_t)baudRateDivisor);
    }
    else
#endif
    {
        /* program the sbr (baudRateDivisor) value to the BDH and BDL registers*/
        BW_UART_BDH_SBR(uartInstance, (uint8_t)(baudRateDivisor >> 8));
        BW_UART_BDL_SBR(uartInstance, (uint8_t)baudRateDivisor);
    }

    return kStatus_UART_Success;
}

#if FSL_FEATURE_UART_HAS_BAUD_RATE_FINE_ADJUST_SUPPORT
/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_set_baud_rate_fine_adjust
 * Description   : Set the UART baud rate fine adjust. (Note: Feature available on select
 *                 UART instances used in conjunction with baud rate programming)
 * This function, which programs the baud rate fine adjust, is used in conjuction with
 * programming the baud rate modulo divisor in situations where these divisors value are known
 * In this case, the user may not want to call the uart_hal_set_baud_rate() function as the
 * divisors are already known to them.
 *
 *END**************************************************************************/
uart_status_t uart_hal_set_baud_rate_fine_adjust(uint32_t uartInstance, uint8_t baudFineAdjust)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    if (baudFineAdjust > 0x1F)
    {
        /* unsupported bit setting*/
        return kStatus_UART_InvalidBitSetting;
    }

