maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_uart_hal_common_configurations.c
    BW_UART_C4_BRFA(uartInstance, baudFineAdjust);

    return kStatus_UART_Success;
}
#endif

#if FSL_FEATURE_UART_HAS_BAUD_RATE_OVER_SAMPLING_SUPPORT
/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_set_oversampling_ratio
 * Description   : Set the UART baud rate oversampling ratio. (Note: Feature available on select
 *                 UART instances used in conjunction with baud rate programming)
 * This function allows the user to directly configure the oversampling ratio (OSR). Normally this
 * ratio is automatically configured when calling the uart_hal_set_baud_rate(). However, if the user
 * knows the necessary dividers and wishes to directly program them, they also have the option to
 * directly program the OSR.
 * The oversampling ratio should be set between 4x (00011) and 32x (11111), writing
 * an invalid oversampling ratio with result in an error and will be set to a default
 * 16x (01111) oversampling ratio.
 * It is required that the transmitter/receiver be disabled before calling
 * this function.
 *
 *END**************************************************************************/
uart_status_t uart_hal_set_oversampling_ratio(uint32_t uartInstance, uint32_t overSamplingRatio)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    if (overSamplingRatio > 0x1F)
    {
        /* unsupported bit setting*/
        return kStatus_UART_InvalidBitSetting;
    }

    if (uartInstance == 0)
    {
        BW_UART0_C4_OSR(overSamplingRatio);
        return kStatus_UART_Success;
    }
    else
    {
        return kStatus_UART_OverSamplingNotSupported;
    }
}
#endif

#if FSL_FEATURE_UART_HAS_BOTH_EDGE_SAMPLING_SUPPORT
/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_both_edge_sampling
 * Description   : Configure the UART baud rate both edge sampling option.
 *                 (Note: Feature available on select UART instances used in conjunction with
 *                 baud rate programming)
 * This function allows the user to directly configure the both edge sampling option.
 * When enabled, the received data is sampled on both edges of the baud rate clock.
 * This must be set when the oversampling ratio is between 4x and 7x.
 * This function should only be called when the receiver is disabled.
 *
 *END**************************************************************************/
uart_status_t uart_hal_configure_both_edge_sampling(uint32_t uartInstance,
                                                    bool enableBothEdgeSampling)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    if (uartInstance == 0)
    {
        BW_UART0_C5_BOTHEDGE(enableBothEdgeSampling);
        return kStatus_UART_Success;
    }
    else
    {
        return kStatus_UART_BothEdgeNotSupported;
    }
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_both_edge_sampling
 * Description   : Configure number of bits per character in the UART controller.
 * This function allows the user to configure the number of bits per character according to the
 * typedef uart_bit_count_per_char_t.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
uart_status_t uart_hal_configure_bit_count_per_char(uint32_t uartInstance,
                                               uart_bit_count_per_char_t bitCountPerChar)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* configure number of bits in a char*/
#if FSL_FEATURE_UART_HAS_10BIT_DATA_SUPPORT
    if (uartInstance == 0)
    {
        if(bitCountPerChar == kUart10BitsPerChar)
        {
            HW_UART0_C4_SET(BM_UART0_C4_M10); /*set M10 for 10-bit mode, M bit in C1 is don't care*/
        }
        else
        {
            BW_UART0_C1_M(bitCountPerChar);  /* config 8- (M=0) or 9-bits (M=1) */
            HW_UART0_C4_CLR(BM_UART0_C4_M10); /* clear M10 to make sure not 10-bit mode*/
        }
    }
    else
#endif
    {
        if(bitCountPerChar == kUart10BitsPerChar)
        {
            /* re-enable the UART transmitter and receiver*/
            uart_hal_enable_transmitter(uartInstance);
            uart_hal_enable_receiver(uartInstance);

            /* illegal value, this uart instance does not support 10-bit*/
            return kStatus_UART_BitCountNotSupported;
        }
        else
        {
            BW_UART_C1_M(uartInstance, bitCountPerChar);  /* config 8- (M=0) or 9-bits (M=1) */
        }
    }

    return kStatus_UART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_parity_mode
 * Description   : Configure the parity mode in the UART controller.
 * This function allows the user to configure the parity mode of the UART controller to disable
 * it or enable it for even parity or for odd parity.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
void uart_hal_configure_parity_mode(uint32_t uartInstance, uart_parity_mode_t parityModeType)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* configure the parity enable/type    */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        if ((parityModeType) == 0)
        {
            /* parity disabled, hence parity type is don't care*/
            HW_UART0_C1_CLR(BM_UART0_C1_PE);
        }
        else
        {
            /* parity enabled*/
            HW_UART0_C1_SET(BM_UART0_C1_PE);
            /* parity odd/even depending on parity mode setting*/
            BW_UART0_C1_PT((parityModeType) & 0x1);
        }
    }
    else
#endif
    {
        if ((parityModeType) == 0)
        {
            /* parity disabled, hence parity type is don't care*/
            HW_UART_C1_CLR(uartInstance, BM_UART_C1_PE);
        }
        else
        {
            /* parity enabled*/
            HW_UART_C1_SET(uartInstance, BM_UART_C1_PE);
            /* parity odd/even depending on parity mode setting*/
            BW_UART_C1_PT(uartInstance, (parityModeType) & 0x1);
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_stop_bit_count
 * Description   : Configure the number of stop bits in the UART controller.
 * This function allows the user to configure the number of stop bits in the UART controller
 * to be one or two stop bits.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
uart_status_t uart_hal_configure_stop_bit_count(uint32_t uartInstance,
                                           uart_stop_bit_count_t stopBitCount)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

