maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_uart_hal_common_configurations.c
#if FSL_FEATURE_UART_HAS_STOP_BIT_CONFIG_SUPPORT
    /* configure the number of stop bits*/
    if (uartInstance == 0)
    {
        BW_UART0_BDH_SBNS(stopBitCount);
    }
    else
    {
        BW_UART_BDH_SBNS(uartInstance, stopBitCount);
    }

    return kStatus_UART_Success;
#else
    /* stop bit configuration not supported, only one stop bit is supported*/
    if(stopBitCount != kUartOneStopBit)
    {
        return kStatus_UART_StopBitCountNotSupported;
    }
    else
    {
        return kStatus_UART_Success;
    }
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_tx_rx_inversion
 * Description   : Configure the transmit and receive inversion control in UART controller.
 * This function allows the user to invert the transmit and receive signals, independently.
 * This function should only be called when the UART is between transmit and receive packets.
 *
 *END**************************************************************************/
void uart_hal_configure_tx_rx_inversion(uint32_t uartInstance, uint32_t rxInvert, uint32_t txInvert)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* configure tx and rx inversions*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* 0 - receive data not inverted, 1 - receive data inverted */
        BW_UART0_S2_RXINV(rxInvert);
        /* 0 - transmit data not inverted, 1 - transmit data inverted*/
        BW_UART0_C3_TXINV(txInvert);
    }
    else
#endif
    {
        /* 0 - receive data not inverted, 1 - receive data inverted */
        BW_UART_S2_RXINV(uartInstance, rxInvert);
        /* 0 - transmit data not inverted, 1 - transmit data inverted*/
        BW_UART_C3_TXINV(uartInstance, txInvert);
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_transmitter
 * Description   : Enable the UART transmitter.
 * This function allows the user to enable the UART transmitter.
 *
 *END**************************************************************************/
void uart_hal_enable_transmitter(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* enable the transmitter based on the uart instance*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_SET(BM_UART0_C2_TE);
    }
    else
#endif
    {
        /* for this uart instance, there is a two step process to clear the transmit complete
         * status flag:
         * 1. Read the status register with the status bit set
         * 2. enable the transmitter (change TE from 0 to 1)
         */

        /*  first read the status register
         * no need to store the read value, it's assumed the status bit is set
         */
        HW_UART_S1_RD(uartInstance);
        /* second, enable the transmitter */
        HW_UART_C2_SET(uartInstance, BM_UART_C2_TE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_transmitter
 * Description   : Disable the UART transmitter.
 * This function allows the user to disable the UART transmitter.
 *
 *END**************************************************************************/
void uart_hal_disable_transmitter(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* disable the transmitter based on the uart instance*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_CLR(BM_UART0_C2_TE);
    }
    else
#endif
    {
        HW_UART_C2_CLR(uartInstance, BM_UART_C2_TE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_is_transmitter_enabled
 * Description   : Get the UART transmitter enabled/disabled configuration setting.
 * This function allows the user to get the setting of the UART transmitter.
 *
 *END**************************************************************************/
bool uart_hal_is_transmitter_enabled(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* get the transmitter config based on the uart instance*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        return HW_UART0_C2.B.TE;
    }
    else
#endif
    {
        return HW_UART_C2(uartInstance).B.TE;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_receiver
 * Description   : Enable the UART receiver.
 * This function allows the user to enable the UART receiver.
 *
 *END**************************************************************************/
void uart_hal_enable_receiver(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* enable the receiver based on the uart instance*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_SET(BM_UART0_C2_RE);
    }
    else
#endif
    {
        HW_UART_C2_SET(uartInstance, BM_UART_C2_RE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_receiver
 * Description   : Disable the UART receiver.
 * This function allows the user to disable the UART receiver.
 *
 *END**************************************************************************/
void uart_hal_disable_receiver(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* disable the receiver based on the uart instance*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_CLR(BM_UART0_C2_RE);
    }
    else
#endif
    {
        HW_UART_C2_CLR(uartInstance, BM_UART_C2_RE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_is_receiver_enabled
 * Description   : Get the UART receiver enabled/disabled configuration setting.
 * This function allows the user to get the setting of the UART receiver.
 *
 *END**************************************************************************/
bool uart_hal_is_receiver_enabled(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* get the receiver config based on the uart instance*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        return HW_UART0_C2.B.RE;
    }
    else
#endif
    {
        return HW_UART_C2(uartInstance).B.RE;
    }
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

